{
  "class_uid": "Integer: Required: Must be 2005 for Incident Finding.",
  "class_name": "String: Required: Must be \"Incident Finding\".",

  "finding_uid": "String: Required: Unique identifier of the finding.",
  "title": "String: Required: Title or brief phrase summarizing the incident finding.",
  "desc": "String: Optional: Description of the incident finding.",

  "severity_id": "Integer: Optional: Numeric severity level as defined by OCSF.",
  "severity": "String: Optional: Human readable severity name.",

  "status_id": "Integer: Optional: Numeric status of the finding (e.g., New, In Progress, Closed).",
  "status": "String: Optional: Human readable status.",

  "confidence": "Integer: Optional: Confidence score (0–100) that the finding is valid.",

  "created_time": "Timestamp String: Optional: Time when the finding record was created.",
  "first_seen_time": "Timestamp String: Optional: Time when the incident activity was first observed.",
  "last_seen_time": "Timestamp String: Optional: Time when the incident activity was last observed.",
  "modified_time": "Timestamp String: Optional: Time when the finding was last modified.",

  "types": "Array of String: Optional: One or more OCSF incident or finding type classifications.",

  "product": {
    "name": "String: Optional: Name of the product that generated the finding.",
    "uid": "String: Optional: Unique identifier of the product."
  },

  "related_events": "Array of String: Optional: UIDs of related events.",

  "remediation": {
    "desc": "String: Optional: Description of how the incident was or should be remediated."
  },

  "references": "Array of String: Optional: URLs pointing to the source or supporting material for the finding.",

  "supporting_data": "String: Optional: Any additional context or evidence about the finding.",

  "metadata": {
    "uid": "String: Optional: Original finding UID from the source system.",
    "activity_id": "String: Optional: Rule, control, or activity that produced the finding.",

    "extensions": {
      "custom_attributes": {
        "comments": "Array: Optional: An array of JSON objects with fields 'author', 'timestamp', 'text'.",
        "tlp": "Integer: Optional: Traffic Light Protocol classification. Default: 2."
      }
    }
  }
}
